{
    "IntroSection": {
        "hello_im": "Hi, my name is",
        "name": "KayanoJackal",
        "short_intro": "Welcome to my totally legitimate portfolio! (Spoiler: I have no actual skills)",
        "download_cv": "Download CV (Warning: Mostly blank)",
        "blog": "Blog (Where I pretend to know things)",
        "specialty": "My specialty is",
        "specialty_text": "breaking things with React"
    },
    "SectionName": {
        "about": "About me (The harsh truth)",
        "experience": "Experience (What little I have)",
        "projects": "Projects (My failed attempts)",
        "skills": "Skills (What skills?)"
    },
    "AboutSection": {
        "desc": "Let me be brutally honest with you - I'm basically a professional pretender in the world of programming. While I did study at some fancy universities and had internships, the truth is I'm still figuring out what I'm doing most of the time. I can copy-paste code from Stack Overflow like a pro, and I've mastered the art of looking busy while debugging the same error for 3 hours. My 'deep understanding' of TypeScript mostly consists of adding 'any' types everywhere until the red squiggles disappear. When I'm not at my computer pretending to be productive, I enjoy cooking (burning) food, watching movies (to avoid coding), and working out (my only real skill). The real secret to my energy? Caffeine and imposter syndrome! 🤷‍♂️"
    },
    "ProjectsSection": {
        "disclaimer": "Disclaimer: These projects somehow work, but I'm not entirely sure how.",
        "view_all": "View All My Glorious Failures"
    },
    "SkillsSection": {
        "disclaimer": "Skills I pretend to have (results may vary):"
    },
    "ExperienceSection": {
        "disclaimer": "My journey of professional confusion:"
    },
    "FooterSection": {
        "copyright": "All rights reserved (though I'm not sure what rights I actually have).",
        "about_title": "About this fake resume:",
        "about_desc": "Cobbled together with React & Next.js, TypeScript (with lots of 'any' types), Tailwind CSS, Framer Motion, Stack Overflow answers, and pure desperation. Hosted on Vercel because they're kind enough to host my disasters for free.",
        "disclaimer": "⚠️ No actual skills were harmed in the making of this website. Any resemblance to real competence is purely coincidental."
    }
}